results/rtx4090_x_4_QuantTrio_Qwen3-Coder-30B-A3B-Instruct-AWQ_vllm_benchmark.txt
============ Serving Benchmark Result ============
Successful requests:                     1000      
Maximum request concurrency:             200       
Benchmark duration (s):                  239.26    
Total input tokens:                      997272    
Total generated tokens:                  1000000   
Request throughput (req/s):              4.18      
Output token throughput (tok/s):         4179.56   
Peak output token throughput (tok/s):    6792.00   
Peak concurrent requests:                246.00    
Total Token throughput (tok/s):          8347.72   
---------------Time to First Token----------------
Mean TTFT (ms):                          15380.62  
Median TTFT (ms):                        19905.74  
P99 TTFT (ms):                           26625.63  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          28.98     
Median TPOT (ms):                        24.37     
P99 TPOT (ms):                           46.95     
---------------Inter-token Latency----------------
Mean ITL (ms):                           29.09     
Median ITL (ms):                         21.96     
P99 ITL (ms):                            128.23    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          44327.57  
Median E2EL (ms):                        47641.90  
P99 E2EL (ms):                           51101.04  
==================================================