results/rtx4090_x_4_ibnzterrell_Meta-Llama-3.3-70B-Instruct-AWQ-INT4_vllm_benchmark.txt
============ Serving Benchmark Result ============
Successful requests:                     903       
Maximum request concurrency:             400       
Benchmark duration (s):                  1990.16   
Total input tokens:                      900465    
Total generated tokens:                  903000    
Request throughput (req/s):              0.45      
Output token throughput (tok/s):         453.73    
Peak output token throughput (tok/s):    900.00    
Peak concurrent requests:                332.00    
Total Token throughput (tok/s):          906.19    
---------------Time to First Token----------------
Mean TTFT (ms):                          464840.14 
Median TTFT (ms):                        555965.86 
P99 TTFT (ms):                           597963.05 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          84.33     
Median TPOT (ms):                        69.57     
P99 TPOT (ms):                           130.18    
---------------Inter-token Latency----------------
Mean ITL (ms):                           84.25     
Median ITL (ms):                         52.72     
P99 ITL (ms):                            824.73    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          549089.99 
Median E2EL (ms):                        639902.04 
P99 E2EL (ms):                           709325.68 
==================================================

============ Docker Compose Configuration ============
services:
  vllm_0:
    image: vllm/vllm-openai:latest
    container_name: vllm_benchmark_container_0
    deploy:
      resources:
        reservations:
          devices:
            - driver: nvidia
              device_ids: ['0', '1']
              capabilities: [gpu]
    volumes:
      - /hf_models:/hf_models
    environment:
      - HUGGING_FACE_HUB_TOKEN=
    ports:
      - "8000:8000"
    shm_size: '16gb'
    ipc: host
    command: >
      --trust-remote-code
      --gpu-memory-utilization=0.9
      --host 0.0.0.0
      --port 8000
      --tensor-parallel-size 1
      --pipeline-parallel-size 2
      --model /hf_models/ibnzterrell/Meta-Llama-3.3-70B-Instruct-AWQ-INT4
      --served-model-name ibnzterrell/Meta-Llama-3.3-70B-Instruct-AWQ-INT4
      --max-model-len 8192 --kv-cache-dtype fp8
    healthcheck:
      test: ["CMD", "bash", "-c", "curl -f http://localhost:8000/health && curl -f http://localhost:8000/v1/models | grep -q 'object.*list'"]
      interval: 10s
      timeout: 10s
      retries: 180
      start_period: 600s

  vllm_1:
    image: vllm/vllm-openai:latest
    container_name: vllm_benchmark_container_1
    deploy:
      resources:
        reservations:
          devices:
            - driver: nvidia
              device_ids: ['2', '3']
              capabilities: [gpu]
    volumes:
      - /hf_models:/hf_models
    environment:
      - HUGGING_FACE_HUB_TOKEN=
    ports:
      - "8001:8000"
    shm_size: '16gb'
    ipc: host
    command: >
      --trust-remote-code
      --gpu-memory-utilization=0.9
      --host 0.0.0.0
      --port 8000
      --tensor-parallel-size 1
      --pipeline-parallel-size 2
      --model /hf_models/ibnzterrell/Meta-Llama-3.3-70B-Instruct-AWQ-INT4
      --served-model-name ibnzterrell/Meta-Llama-3.3-70B-Instruct-AWQ-INT4
      --max-model-len 8192 --kv-cache-dtype fp8
    healthcheck:
      test: ["CMD", "bash", "-c", "curl -f http://localhost:8000/health && curl -f http://localhost:8000/v1/models | grep -q 'object.*list'"]
      interval: 10s
      timeout: 10s
      retries: 180
      start_period: 600s

  nginx:
    image: nginx:alpine
    container_name: nginx_lb
    ports:
      - "8080:8080"
    volumes:
      - /home/riftuser/server-benchmark/nginx.vllm.conf:/etc/nginx/nginx.conf:ro
    depends_on:
      - vllm_0
      - vllm_1

  benchmark:
    image: vllm/vllm-openai:latest
    container_name: vllm_benchmark_client
    deploy:
      resources:
        reservations:
          devices:
            - driver: nvidia
              count: all
              capabilities: [gpu]
    volumes:
      - /hf_models:/hf_models
    environment:
      - HUGGING_FACE_HUB_TOKEN=
      - CUDA_VISIBLE_DEVICES=""
    entrypoint: ["/bin/bash", "-c"]
    command: ["sleep infinity"]
    profiles:
      - tools

============ Benchmark Command ============
vllm bench serve     --model ibnzterrell/Meta-Llama-3.3-70B-Instruct-AWQ-INT4     --dataset-name random     --random-input-len 1000     --random-output-len 1000     --max-concurrency 400     --num-prompts 1200     --ignore-eos     --backend openai-chat     --endpoint /v1/chat/completions     --percentile-metrics ttft,tpot,itl,e2el     --base-url http://nginx_lb:8080
==================================================