results/rtx5090_x_1_QuantTrio_Qwen3-Coder-30B-A3B-Instruct-AWQ_vllm_benchmark.txt
============ Serving Benchmark Result ============
Successful requests:                     1000      
Maximum request concurrency:             200       
Benchmark duration (s):                  427.15    
Total input tokens:                      997272    
Total generated tokens:                  1000000   
Request throughput (req/s):              2.34      
Output token throughput (tok/s):         2341.12   
Peak output token throughput (tok/s):    4480.00   
Peak concurrent requests:                218.00    
Total Token throughput (tok/s):          4675.85   
---------------Time to First Token----------------
Mean TTFT (ms):                          38448.48  
Median TTFT (ms):                        39443.24  
P99 TTFT (ms):                           73332.72  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          41.62     
Median TPOT (ms):                        35.15     
P99 TPOT (ms):                           65.36     
---------------Inter-token Latency----------------
Mean ITL (ms):                           41.61     
Median ITL (ms):                         27.73     
P99 ITL (ms):                            139.74    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          80028.53  
Median E2EL (ms):                        78232.64  
P99 E2EL (ms):                           108597.07 
==================================================